{ "type": "success", "value": [ { "id": 365, "joke": "Chuck Norris has never won an Academy Award for acting... because he's not acting.", "categories": [] }, { "id": 191, "joke": "The easiest way to determine Chuck Norris' age is to cut him in half and count the rings.", "categories": [] }, { "id": 4, "joke": "If you ask Chuck Norris what time it is, he always answers &quot;Two seconds till&quot;. After you ask &quot;Two seconds to what?&quot;, he roundhouse kicks you in the face.", "categories": [] }, { "id": 514, "joke": "Chuck Norris doesn't use a computer because a computer does everything slower than Chuck Norris.", "categories": [] }, { "id": 108, "joke": "The show Survivor had the original premise of putting people on an island with Chuck Norris. There were no survivors, and nobody is brave enough to go to the island to retrieve the footage.", "categories": [] }, { "id": 345, "joke": "When in a bar, you can order a drink called a &quot;Chuck Norris&quot;. It is also known as a &quot;Bloody Mary&quot;, if your name happens to be Mary.", "categories": [] }, { "id": 266, "joke": "Chuck Norris? roundhouse kick is so powerful, it can be seen from outer space by the naked eye.", "categories": [] }, { "id": 459, "joke": "Chuck Norris can solve the Towers of Hanoi in one move.", "categories": ["nerdy"] }, { "id": 411, "joke": "The pen is mightier than the sword, but only if the pen is held by Chuck Norris.", "categories": [] }, { "id": 549, "joke": "Chuck Norris killed two stones with one bird.", "categories": [] }, { "id": 188, "joke": "MacGyver can build an airplane out of gum and paper clips, but Chuck Norris can roundhouse-kick his head through a wall and take it.", "categories": [] }, { "id": 147, "joke": "Science Fact: Roundhouse kicks are comprised primarily of an element called Chucktanium.", "categories": [] }, { "id": 457, "joke": "MySpace actually isn't your space, it's Chuck's (he just lets you use it).", "categories": ["nerdy"] }, { "id": 109, "joke": "It takes Chuck Norris 20 minutes to watch 60 Minutes.", "categories": [] }, { "id": 274, "joke": "One time, Chuck Norris accidentally stubbed his toe. It destroyed the entire state of Ohio.", "categories": [] }, { "id": 552, "joke": "Chuck Norris knows the value of NULL, and he can sort by it too.", "categories": ["nerdy"] }, { "id": 40, "joke": "A handicapped parking sign does not signify that this spot is for handicapped people. It is actually in fact a warning, that the spot belongs to Chuck Norris and that you will be handicapped if you park there.", "categories": [] }, { "id": 515, "joke": "Chuck Norris compresses his files by doing a flying round house kick to the hard drive.", "categories": ["nerdy"] }, { "id": 221, "joke": "Chuck Norris is the only person to ever win a staring contest against Ray Charles and Stevie Wonder.", "categories": [] }, { "id": 74, "joke": "In honor of Chuck Norris, all McDonald's in Texas have an even larger size than the super-size. When ordering, just ask to be Chucksized.", "categories": [] }, { "id": 321, "joke": "Chuck Norris is widely predicted to be first black president. If you're thinking to yourself, &quot;But Chuck Norris isn't black&quot;, then you are dead wrong. And stop being a racist.", "categories": [] }, { "id": 587, "joke": "Once a police officer caught Chuck Norris, the cop was lucky enough to escape with a warning.", "categories": [] }, { "id": 448, "joke": "When Chuck Norris throws exceptions, it's across the room.", "categories": ["nerdy"] } ]  }
